Revit 2027 API
FillPattern(String, FillPatternTarget, FillPatternHostOrientation) Constructor
 Creates a fill pattern based on the given name, FillPatternTarget and FillPatternHostOrientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillPattern(
	string name,
	FillPatternTarget target,
	FillPatternHostOrientation orientation
)
Public Sub New (
	name As String,
	target As FillPatternTarget,
	orientation As FillPatternHostOrientation
)
public:
FillPattern(
	String^ name,
	FillPatternTarget target,
	FillPatternHostOrientation orientation
)
new :
        name : string *
        target : FillPatternTarget *
        orientation : FillPatternHostOrientation -> FillPattern
Parameters
name String
 The name.
target FillPatternTarget
 The fill pattern target.
orientation FillPatternHostOrientation
 The fill pattern orientation.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FillPattern Class
FillPattern Overload
Autodesk.Revit.DB Namespace